{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.3", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_5", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 16], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"units": 128, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5", "config": {"units": 12544, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "target_shape": [64, 14, 14], "name": "reshape_1"}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_1", "padding": "same", "use_bias": true, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_2", "padding": "same", "use_bias": true, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_3", "padding": "valid", "use_bias": true, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_5", "padding": "valid", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}], "name": "model_2"}}