{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.3", "config": {"output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 5, 5], "sparse": false, "dtype": "float32", "name": "decoder_input"}}, {"class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_first", "activity_regularizer": null, "filters": 8, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "decoder_conv2DT_1", "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "decoder_up_sampling_1"}}, {"class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_first", "activity_regularizer": null, "filters": 8, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "decoder_conv2DT_2", "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_first", "size": [2, 2], "name": "decoder_up_sampling_2"}}, {"class_name": "Conv2DTranspose", "name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_first", "activity_regularizer": null, "filters": 1, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "name": "decoder_conv2DT_3", "kernel_regularizer": null}}], "name": "model_2"}}