{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "decoder_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 11, 11], "sparse": false, "dtype": "float32", "name": "decoder_input"}}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "decoder_conv2DT_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "filters": 8, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_first"}}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2], "data_format": "channels_first"}}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"name": "decoder_conv2DT_2", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "filters": 1, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_first"}}], "name": "model_2", "input_layers": [["decoder_input", 0, 0]], "output_layers": [["decoder_conv2DT_2", 0, 0]]}, "keras_version": "2.0.3"}