{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "encoder_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "sparse": false, "dtype": "float32", "name": "encoder_input"}}, {"name": "encoder_conv2D_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "encoder_conv2D_1", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "filters": 8, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid"}}, {"name": "encoder_max_pooling_1", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "encoder_max_pooling_1", "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}}, {"name": "encoder_z_mean", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "encoder_z_mean", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "filters": 4, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid"}}, {"name": "encoder_z_log_var", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "encoder_z_log_var", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "filters": 4, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "kernel_regularizer": null, "padding": "valid"}}, {"name": "latent_space", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "class_name": "Lambda", "config": {"name": "latent_space", "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "output_shape": null}}], "name": "model_1", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["latent_space", 0, 0]]}, "keras_version": "2.0.3"}