{"keras_version": "2.0.3", "backend": "tensorflow", "config": {"name": "model_2", "layers": [{"name": "decoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 11, 11], "sparse": false, "dtype": "float32", "name": "decoder_input"}, "inbound_nodes": []}, {"name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "activation": "relu", "name": "decoder_conv2DT_1"}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"name": "decoder_up_sampling_1", "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 1, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "activation": "sigmoid", "name": "decoder_conv2DT_2"}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}], "output_layers": [["decoder_conv2DT_2", 0, 0]], "input_layers": [["decoder_input", 0, 0]]}, "class_name": "Model"}