{"keras_version": "2.0.3", "backend": "tensorflow", "config": {"name": "model_3", "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "sparse": false, "dtype": "float32", "name": "encoder_input"}, "inbound_nodes": []}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["latent_space", 0, 0]], "layers": [{"name": "encoder_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 28, 28], "sparse": false, "dtype": "float32", "name": "encoder_input"}, "class_name": "InputLayer"}, {"name": "encoder_conv2D_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "name": "encoder_conv2D_1", "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"name": "encoder_max_pooling_1", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_first", "name": "encoder_max_pooling_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "encoder_z_mean", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 4, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "name": "encoder_z_mean", "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"name": "encoder_z_log_sigma", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 4, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "name": "encoder_z_log_sigma", "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2D"}, {"name": "latent_space", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]], "config": {"name": "latent_space", "arguments": {}, "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null]}, "class_name": "Lambda"}]}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "model_2", "class_name": "Model", "config": {"name": "model_2", "input_layers": [["decoder_input", 0, 0]], "output_layers": [["decoder_conv2DT_2", 0, 0]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 11, 11], "sparse": false, "dtype": "float32", "name": "decoder_input"}, "class_name": "InputLayer"}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 8, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "decoder_conv2DT_1", "strides": [1, 1], "activation": "relu"}, "class_name": "Conv2DTranspose"}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"data_format": "channels_first", "name": "decoder_up_sampling_1", "size": [2, 2], "trainable": true}, "class_name": "UpSampling2D"}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_initializer": {"config": {"stddev": 0.5, "seed": null, "mean": 1.0}, "class_name": "TruncatedNormal"}, "data_format": "channels_first", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 1, "kernel_size": [3, 3], "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "decoder_conv2DT_2", "strides": [1, 1], "activation": "sigmoid"}, "class_name": "Conv2DTranspose"}]}, "inbound_nodes": [[["model_1", 1, 0, {}]]]}], "output_layers": [["model_2", 1, 0]], "input_layers": [["encoder_input", 0, 0]]}, "class_name": "Model"}