{"config": {"layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 10], "name": "decoder_input"}, "inbound_nodes": [], "name": "decoder_input", "class_name": "InputLayer"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 512, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 3136, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"trainable": true, "target_shape": [64, 7, 7], "name": "reshape_1"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2DT_1", "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "filters": 64, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "encoder_conv2DT_1", "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2DT_2", "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "filters": 32, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["encoder_conv2DT_1", 0, 0, {}]]], "name": "encoder_conv2DT_2", "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2DT_3", "activation": "sigmoid", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "filters": 1, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["encoder_conv2DT_2", 0, 0, {}]]], "name": "encoder_conv2DT_3", "class_name": "Conv2DTranspose"}], "output_layers": [["encoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2"}, "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model"}