{"config": {"layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, 84, 84], "name": "encoder_input"}, "inbound_nodes": [], "name": "encoder_input", "class_name": "InputLayer"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2D_1", "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [6, 6], "filters": 32, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "encoder_conv2D_1", "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2D_2", "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [6, 6], "filters": 64, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_conv2D_2", "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_conv2D_3", "activation": "relu", "data_format": "channels_first", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [6, 6], "filters": 64, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "strides": [2, 2], "kernel_constraint": null, "padding": "valid"}, "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "name": "encoder_conv2D_3", "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["encoder_conv2D_3", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "encoder_dense_1", "units": 512, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "encoder_dense_1", "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_z_mean", "units": 10, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]], "name": "encoder_z_mean", "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "encoder_z_log_var", "units": 10, "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]], "name": "encoder_z_log_var", "class_name": "Dense"}, {"config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_higgins.py\u00da\bsamplingp\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "name": "encoder_z", "output_shape": null, "output_shape_type": "raw", "arguments": {}, "function_type": "lambda"}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "name": "encoder_z", "class_name": "Lambda"}], "output_layers": [["encoder_z", 0, 0]], "input_layers": [["encoder_input", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model"}