{"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 11, 11], "name": "input_2"}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "name": "decoder_conv2DT_1", "strides": [1, 1], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "filters": 8, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "relu"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose"}, {"config": {"size": [2, 2], "trainable": true, "name": "decoder_up_sampling_1", "data_format": "channels_first"}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1", "class_name": "UpSampling2D"}, {"config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "name": "decoder_conv2DT_2", "strides": [1, 1], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "filters": 1, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "sigmoid"}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose"}], "output_layers": [["decoder_conv2DT_2", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Model"}