{"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "name": "encoder_conv2D_1", "strides": [1, 1], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "filters": 8, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "relu"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "encoder_conv2D_1", "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "padding": "valid", "name": "encoder_max_pooling_1", "strides": [2, 2]}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_max_pooling_1", "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "name": "encoder_z_mean", "strides": [1, 1], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "filters": 4, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "relu"}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_mean", "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "name": "encoder_z_log_sigma", "strides": [1, 1], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "filters": 4, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "activation": "relu"}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_log_sigma", "class_name": "Conv2D"}, {"config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "name": "latent_space", "arguments": {}}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]], "name": "latent_space", "class_name": "Lambda"}], "output_layers": [["latent_space", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow", "class_name": "Model"}