{"keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_2", "input_layers": [["decoder_input", 0, 0]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "decoder_input", "dtype": "float32", "batch_input_shape": [null, 4, 11, 11], "sparse": false}}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.5}}, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "mean": 1.0, "stddev": 0.5}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "filters": 8, "strides": [1, 1], "activation": "relu", "trainable": true, "name": "decoder_conv2DT_1", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"name": "decoder_up_sampling_1", "data_format": "channels_first", "size": [2, 2], "trainable": true}}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.5}}, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "mean": 1.0, "stddev": 0.5}}, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "filters": 1, "strides": [1, 1], "activation": "sigmoid", "trainable": true, "name": "decoder_conv2DT_2", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3]}}], "output_layers": [["decoder_conv2DT_2", 0, 0]]}}