{"keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 8, 5, 5], "dtype": "float32", "name": "decoder_input"}, "name": "decoder_input"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 8, "activity_regularizer": null, "name": "decoder_conv2DT_1"}, "name": "decoder_conv2DT_1"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"name": "decoder_up_sampling_1", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "name": "decoder_up_sampling_1"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 4, "activity_regularizer": null, "name": "decoder_conv2DT_2"}, "name": "decoder_conv2DT_2"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "config": {"name": "decoder_up_sampling_2", "trainable": true, "data_format": "channels_first", "size": [2, 2]}, "name": "decoder_up_sampling_2"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "sigmoid", "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "activity_regularizer": null, "name": "decoder_conv2DT_3"}, "name": "decoder_conv2DT_3"}], "output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2"}}