{"keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "name": "encoder_input"}, "name": "encoder_input"}, {"class_name": "Model", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "name": "encoder_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "name": "encoder_input"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "filters": 4, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "encoder_conv2D_1"}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "encoder_conv2D_1"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "encoder_max_pooling_1", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_max_pooling_1"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "filters": 8, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "encoder_conv2D_2"}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_conv2D_2"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "encoder_max_pooling_2", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "name": "encoder_max_pooling_2"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "trainable": true, "filters": 8, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "encoder_z_mean"}, "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "name": "encoder_z_mean"}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "trainable": true, "filters": 8, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "encoder_z_log_var"}, "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "name": "encoder_z_log_var"}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\fcvae_deep.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "arguments": {}, "output_shape": null, "name": "latent_space"}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "name": "latent_space"}], "output_layers": [["latent_space", 0, 0]], "input_layers": [["encoder_input", 0, 0]], "name": "model_1"}, "name": "model_1"}, {"class_name": "Model", "inbound_nodes": [[["model_1", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 5, 5], "name": "decoder_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "name": "decoder_input"}, {"class_name": "Conv2DTranspose", "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "filters": 8, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "valid", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_1"}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "decoder_conv2DT_1"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "decoder_up_sampling_1"}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1"}, {"class_name": "Conv2DTranspose", "config": {"strides": [1, 1], "activation": "relu", "trainable": true, "filters": 4, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_2"}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2"}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "decoder_up_sampling_2"}, "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "name": "decoder_up_sampling_2"}, {"class_name": "Conv2DTranspose", "config": {"strides": [1, 1], "activation": "sigmoid", "trainable": true, "filters": 1, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_3"}, "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "name": "decoder_conv2DT_3"}], "output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2"}, "name": "model_2"}], "output_layers": [["model_2", 1, 0]], "input_layers": [["encoder_input", 0, 0]], "name": "model_3"}}