{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.3", "config": {"input_layers": [["encoder_input", 0, 0]], "output_layers": [["conv2d_5", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "encoder_input", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "sparse": false, "name": "encoder_input"}}, {"inbound_nodes": [[["encoder_input", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "same", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "same", "use_bias": true, "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "same", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_4", "padding": "same", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"units": 128, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"units": 16, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"units": 16, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]], "class_name": "Lambda", "name": "latent_space", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_chollet.py\u00da\bsampling\u0081\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "output_shape": null, "trainable": true, "name": "latent_space", "output_shape_type": "raw", "arguments": {}}}, {"inbound_nodes": [[["latent_space", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"units": 128, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5", "config": {"units": 12544, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "target_shape": [64, 14, 14], "name": "reshape_1"}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_1", "padding": "same", "use_bias": true, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_2", "padding": "same", "use_bias": true, "filters": 64, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "name": "conv2d_transpose_3", "padding": "valid", "use_bias": true, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_size": [2, 2], "dilation_rate": [1, 1], "name": "conv2d_5", "padding": "valid", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null}}], "name": "model_3"}}