{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.3", "config": {"name": "model_2", "output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "decoder_input", "batch_input_shape": [null, 4, 5, 5], "sparse": false, "dtype": "float32"}}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "filters": 8, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "name": "decoder_conv2DT_1", "kernel_constraint": null, "padding": "valid", "bias_constraint": null, "use_bias": true}}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2]}}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"activation": "relu", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "filters": 8, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "name": "decoder_conv2DT_2", "kernel_constraint": null, "padding": "same", "bias_constraint": null, "use_bias": true}}, {"name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_2", "trainable": true, "size": [2, 2]}}, {"name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "config": {"activation": "sigmoid", "strides": [1, 1], "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_first", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "stddev": 0.5, "seed": null}}, "filters": 1, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.5, "seed": null}}, "name": "decoder_conv2DT_3", "kernel_constraint": null, "padding": "same", "bias_constraint": null, "use_bias": true}}]}}