{"class_name": "Model", "keras_version": "2.0.3", "backend": "tensorflow", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 16], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_4", "config": {"kernel_constraint": null, "use_bias": true, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"kernel_constraint": null, "use_bias": true, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 12544, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [64, 14, 14]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_transpose_1", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_transpose_2", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_transpose_3", "data_format": "channels_first", "use_bias": true, "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"padding": "valid", "activity_regularizer": null, "kernel_size": [2, 2], "filters": 1, "name": "conv2d_5", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_5", 0, 0]]}}