{"class_name": "Model", "keras_version": "2.0.3", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "encoder_input", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28], "name": "encoder_input"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [2, 2], "filters": 1, "name": "conv2d_1", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [2, 2], "filters": 64, "name": "conv2d_2", "data_format": "channels_first", "use_bias": true, "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_3", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_4", "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"kernel_constraint": null, "use_bias": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Lambda", "name": "latent_space", "config": {"output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_chollet.py\u00da\bsampling\u009c\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "name": "latent_space"}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["latent_space", 0, 0]]}}