{"config": {"input_layers": [["decoder_input", 0, 0]], "name": "model_2", "layers": [{"config": {"name": "decoder_input", "batch_input_shape": [null, 1, 11, 11], "sparse": false, "dtype": "float32"}, "name": "decoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "name": "decoder_conv2DT_1", "data_format": "channels_first", "use_bias": true, "activation": "relu", "filters": 32, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"name": "decoder_up_sampling_1", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "name": "decoder_up_sampling_1", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "name": "decoder_conv2DT_2", "data_format": "channels_first", "use_bias": true, "activation": "sigmoid", "filters": 1, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}], "output_layers": [["decoder_conv2DT_2", 0, 0]]}, "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model"}