{"config": {"input_layers": [["encoder_input", 0, 0]], "name": "model_3", "layers": [{"config": {"name": "encoder_input", "batch_input_shape": [null, 1, 28, 28], "sparse": false, "dtype": "float32"}, "name": "encoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"input_layers": [["encoder_input", 0, 0]], "name": "model_1", "layers": [{"config": {"name": "encoder_input", "batch_input_shape": [null, 1, 28, 28], "sparse": false, "dtype": "float32"}, "name": "encoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "name": "encoder_conv2D_1", "data_format": "channels_first", "use_bias": true, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "name": "encoder_conv2D_1", "class_name": "Conv2D", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "encoder_max_pooling_1", "data_format": "channels_first", "trainable": true}, "name": "encoder_max_pooling_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "name": "encoder_z_mean", "data_format": "channels_first", "use_bias": true, "activation": "linear", "filters": 1, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "name": "encoder_z_mean", "class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "name": "encoder_z_log_var", "data_format": "channels_first", "use_bias": true, "activation": "linear", "filters": 1, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "name": "encoder_z_log_var", "class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"config": {"function": "sampling", "output_shape": null, "output_shape_type": "raw", "name": "latent_space", "function_type": "function", "trainable": true, "arguments": {}}, "name": "latent_space", "class_name": "Lambda", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]]}], "output_layers": [["latent_space", 0, 0]]}, "name": "model_1", "class_name": "Model", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"config": {"input_layers": [["decoder_input", 0, 0]], "name": "model_2", "layers": [{"config": {"name": "decoder_input", "batch_input_shape": [null, 1, 11, 11], "sparse": false, "dtype": "float32"}, "name": "decoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "name": "decoder_conv2DT_1", "data_format": "channels_first", "use_bias": true, "activation": "relu", "filters": 32, "padding": "valid", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"name": "decoder_up_sampling_1", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "name": "decoder_up_sampling_1", "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "name": "decoder_conv2DT_2", "data_format": "channels_first", "use_bias": true, "activation": "sigmoid", "filters": 1, "padding": "valid", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}], "output_layers": [["decoder_conv2DT_2", 0, 0]]}, "name": "model_2", "class_name": "Model", "inbound_nodes": [[["model_1", 1, 0, {}]]]}], "output_layers": [["model_2", 1, 0]]}, "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model"}