{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 16], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4"}, "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense_4"}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 12544, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5"}, "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5"}, {"config": {"target_shape": [64, 14, 14], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "reshape_1"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_transpose_1", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "conv2d_transpose_1"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_transpose_2", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "conv2d_transpose_2"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [2, 2], "padding": "valid", "name": "conv2d_transpose_3", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "name": "conv2d_transpose_3"}, {"config": {"filters": 1, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "conv2d_5", "activation": "sigmoid", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "name": "conv2d_5"}], "output_layers": [["conv2d_5", 0, 0]], "name": "model_2"}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}