{"config": {"output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 16, 5, 5], "sparse": false, "dtype": "float32", "name": "decoder_input"}, "class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": []}, {"config": {"padding": "valid", "filters": 16, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"seed": null, "mean": 1.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "name": "decoder_conv2DT_1", "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_first"}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "decoder_up_sampling_1", "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 8, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"seed": null, "mean": 1.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "name": "decoder_conv2DT_2", "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_first"}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "decoder_up_sampling_2", "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D", "name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]]}, {"config": {"padding": "same", "filters": 1, "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "bias_initializer": {"config": {"seed": null, "mean": 1.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "name": "decoder_conv2DT_3", "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_first"}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3"}