{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"output_layers": [["decoder_conv2DT_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "encoder_conv2D_1", "config": {"strides": [1, 1], "name": "encoder_conv2D_1", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_first", "trainable": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 1.0, "seed": null}}, "filters": 8, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 0.0, "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "encoder_max_pooling_1", "config": {"strides": [2, 2], "name": "encoder_max_pooling_1", "data_format": "channels_first", "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "encoder_z_mean", "config": {"strides": [1, 1], "name": "encoder_z_mean", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_first", "trainable": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 1.0, "seed": null}}, "filters": 4, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 0.0, "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "encoder_z_log_sigma", "config": {"strides": [1, 1], "name": "encoder_z_log_sigma", "kernel_size": [3, 3], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_first", "trainable": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 1.0, "seed": null}}, "filters": 4, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 0.0, "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"class_name": "Lambda", "name": "latent_space", "config": {"name": "latent_space", "output_shape_type": "raw", "trainable": true, "arguments": {}, "output_shape": null, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0010\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001,\u0001\u0013\u0001\u001e\u0001", null, null]}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "config": {"strides": [1, 1], "name": "decoder_conv2DT_1", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "data_format": "channels_first", "trainable": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 1.0, "seed": null}}, "filters": 8, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 0.0, "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["latent_space", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2]}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "config": {"strides": [1, 1], "name": "decoder_conv2DT_2", "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "data_format": "channels_first", "trainable": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 1.0, "seed": null}}, "filters": 1, "kernel_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "mean": 0.0, "seed": null}}, "kernel_constraint": null}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}]}}