{"config": {"output_layers": [["encoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "decoder_input", "batch_input_shape": [null, 10]}, "name": "decoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "activation": "relu", "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 512, "kernel_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "activation": "relu", "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 3136, "kernel_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"name": "reshape_1", "target_shape": [64, 7, 7], "trainable": true}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"filters": 64, "activation": "relu", "name": "encoder_conv2DT_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2DT_1", "class_name": "Conv2DTranspose", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"filters": 32, "activation": "relu", "name": "encoder_conv2DT_2", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2DT_2", "class_name": "Conv2DTranspose", "inbound_nodes": [[["encoder_conv2DT_1", 0, 0, {}]]]}, {"config": {"filters": 1, "activation": "sigmoid", "name": "encoder_conv2DT_3", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2DT_3", "class_name": "Conv2DTranspose", "inbound_nodes": [[["encoder_conv2DT_2", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model"}