{"config": {"output_layers": [["encoder_z", 0, 0]], "input_layers": [["encoder_input", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "sparse": false, "name": "encoder_input", "batch_input_shape": [null, 1, 84, 84]}, "name": "encoder_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"filters": 32, "activation": "relu", "name": "encoder_conv2D_1", "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2D_1", "class_name": "Conv2D", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"config": {"filters": 64, "activation": "relu", "name": "encoder_conv2D_2", "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2D_2", "class_name": "Conv2D", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]]}, {"config": {"filters": 64, "activation": "relu", "name": "encoder_conv2D_3", "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "trainable": true, "strides": [2, 2], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 6], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "name": "encoder_conv2D_3", "class_name": "Conv2D", "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["encoder_conv2D_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "activation": "relu", "name": "encoder_dense_1", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 512, "kernel_constraint": null}, "name": "encoder_dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "activation": "linear", "name": "encoder_z_mean", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 10, "kernel_constraint": null}, "name": "encoder_z_mean", "class_name": "Dense", "inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "activation": "linear", "name": "encoder_z_log_var", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 10, "kernel_constraint": null}, "name": "encoder_z_log_var", "class_name": "Dense", "inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]]}, {"config": {"output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_higgins.py\u00da\bsamplingp\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "arguments": {}, "name": "encoder_z", "function_type": "lambda", "trainable": true}, "name": "encoder_z", "class_name": "Lambda", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Model"}