{"keras_version": "2.0.4", "backend": "tensorflow", "config": {"name": "model_2", "input_layers": [["decoder_input", 0, 0]], "output_layers": [["encoder_conv2DT_3", 0, 0]], "layers": [{"inbound_nodes": [], "name": "decoder_input", "config": {"name": "decoder_input", "sparse": false, "batch_input_shape": [null, 10], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "dense_1", "config": {"name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 3136, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [64, 7, 7]}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "encoder_conv2DT_1", "config": {"filters": 64, "name": "encoder_conv2DT_1", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2DTranspose"}, {"inbound_nodes": [[["encoder_conv2DT_1", 0, 0, {}]]], "name": "encoder_conv2DT_2", "config": {"filters": 32, "name": "encoder_conv2DT_2", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2DTranspose"}, {"inbound_nodes": [[["encoder_conv2DT_2", 0, 0, {}]]], "name": "encoder_conv2DT_3", "config": {"filters": 1, "name": "encoder_conv2DT_3", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2DTranspose"}]}, "class_name": "Model"}