{"keras_version": "2.0.4", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["encoder_z", 0, 0]], "layers": [{"inbound_nodes": [], "name": "encoder_input", "config": {"name": "encoder_input", "sparse": false, "batch_input_shape": [null, 1, 84, 84], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "encoder_conv2D_1", "config": {"filters": 32, "name": "encoder_conv2D_1", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_conv2D_2", "config": {"filters": 64, "name": "encoder_conv2D_2", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "name": "encoder_conv2D_3", "config": {"filters": 64, "name": "encoder_conv2D_3", "data_format": "channels_first", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [6, 6], "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [2, 2], "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["encoder_conv2D_3", 0, 0, {}]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "encoder_dense_1", "config": {"name": "encoder_dense_1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]], "name": "encoder_z_mean", "config": {"name": "encoder_z_mean", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["encoder_dense_1", 0, 0, {}]]], "name": "encoder_z_log_var", "config": {"name": "encoder_z_log_var", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "kernel_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "name": "encoder_z", "config": {"name": "encoder_z", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_higgins.py\u00da\bsamplingp\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "trainable": true}, "class_name": "Lambda"}]}, "class_name": "Model"}