{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"input_layers": [["decoder_input", 0, 0]], "name": "model_2", "output_layers": [["decoder_conv2DT_3", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "decoder_input", "config": {"batch_input_shape": [null, 2, 5, 5], "dtype": "float32", "name": "decoder_input", "sparse": false}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "decoder_conv2DT_1", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_1", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "data_format": "channels_first", "padding": "valid", "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "bias_constraint": null, "trainable": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1", "config": {"name": "decoder_up_sampling_1", "size": [2, 2], "data_format": "channels_first", "trainable": true}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_2", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "data_format": "channels_first", "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "bias_constraint": null, "trainable": true, "activation": "relu", "strides": [1, 1], "kernel_regularizer": null}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "name": "decoder_up_sampling_2", "config": {"name": "decoder_up_sampling_2", "size": [2, 2], "data_format": "channels_first", "trainable": true}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "name": "decoder_conv2DT_3", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_3", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "data_format": "channels_first", "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "filters": 1, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "strides": [1, 1], "kernel_regularizer": null}}]}}