{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"input_layers": [["encoder_input", 0, 0]], "name": "model_3", "output_layers": [["model_2", 1, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "encoder_input", "config": {"batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "name": "encoder_input", "sparse": false}}, {"class_name": "Model", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "model_1", "config": {"input_layers": [["encoder_input", 0, 0]], "name": "model_1", "output_layers": [["latent_space", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "encoder_input", "config": {"batch_input_shape": [null, 1, 28, 28], "name": "encoder_input", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "encoder_conv2D_1", "config": {"use_bias": true, "activity_regularizer": null, "name": "encoder_conv2D_1", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_max_pooling_1", "config": {"name": "encoder_max_pooling_1", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_conv2D_2", "config": {"use_bias": true, "activity_regularizer": null, "name": "encoder_conv2D_2", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "name": "encoder_max_pooling_2", "config": {"name": "encoder_max_pooling_2", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "name": "encoder_z_mean", "config": {"use_bias": true, "activity_regularizer": null, "name": "encoder_z_mean", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "name": "encoder_z_log_var", "config": {"use_bias": true, "activity_regularizer": null, "name": "encoder_z_log_var", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "strides": [1, 1], "trainable": true}}, {"class_name": "Lambda", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "name": "latent_space", "config": {"name": "latent_space", "output_shape_type": "raw", "output_shape": null, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\fcvae_deep.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "function_type": "lambda", "trainable": true}}]}}, {"class_name": "Model", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "model_2", "config": {"input_layers": [["decoder_input", 0, 0]], "name": "model_2", "output_layers": [["decoder_conv2DT_3", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "decoder_input", "config": {"batch_input_shape": [null, 2, 5, 5], "name": "decoder_input", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "decoder_conv2DT_1", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_1", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "trainable": true}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1", "config": {"name": "decoder_up_sampling_1", "size": [2, 2], "data_format": "channels_first", "trainable": true}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_2", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "filters": 2, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "trainable": true}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "name": "decoder_up_sampling_2", "config": {"name": "decoder_up_sampling_2", "size": [2, 2], "data_format": "channels_first", "trainable": true}}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "name": "decoder_conv2DT_3", "config": {"use_bias": true, "activity_regularizer": null, "name": "decoder_conv2DT_3", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "data_format": "channels_first", "padding": "same", "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "filters": 1, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "strides": [1, 1], "trainable": true}}]}}]}}