{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"name": "model_2", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 4, 11, 11], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "config": {"name": "decoder_conv2DT_1", "strides": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "padding": "valid", "use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "filters": 8, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}, {"inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "decoder_up_sampling_1"}}, {"inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "config": {"name": "decoder_conv2DT_2", "strides": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 1.0}}, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.5, "seed": null, "mean": 0.0}}, "padding": "valid", "use_bias": true, "data_format": "channels_first", "activity_regularizer": null, "activation": "sigmoid", "bias_regularizer": null, "bias_constraint": null, "filters": 1, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "trainable": true}}], "input_layers": [["input_2", 0, 0]], "output_layers": [["decoder_conv2DT_2", 0, 0]]}}