{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.3", "config": {"name": "model_3", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model", "name": "model_1", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "encoder_conv2D_1", "config": {"bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 8, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "encoder_conv2D_1", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}}}, {"inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "encoder_max_pooling_1", "config": {"pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "encoder_max_pooling_1", "trainable": true}}, {"inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "encoder_z_mean", "config": {"bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 4, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "encoder_z_mean", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}}}, {"inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "encoder_z_log_sigma", "config": {"bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 4, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "encoder_z_log_sigma", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}}}, {"inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]], "class_name": "Lambda", "name": "latent_space", "config": {"arguments": {}, "output_shape": null, "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "name": "latent_space"}}], "output_layers": [["latent_space", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}, {"inbound_nodes": [[["model_1", 1, 0, {}]]], "class_name": "Model", "name": "model_2", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, 4, 11, 11], "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "config": {"bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "padding": "valid", "trainable": true, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 8, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "decoder_conv2DT_1", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}}}, {"inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "config": {"data_format": "channels_first", "size": [2, 2], "trainable": true, "name": "decoder_up_sampling_1"}}, {"inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "config": {"bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "padding": "valid", "trainable": true, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "filters": 1, "bias_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "name": "decoder_conv2DT_2", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}}}], "output_layers": [["decoder_conv2DT_2", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "model_2"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["model_2", 1, 0]]}}