{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_2", "input_layers": [["decoder_input", 0, 0]], "output_layers": [["decoder_conv2DT_3", 0, 0]], "layers": [{"name": "decoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 5, 5], "name": "decoder_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "relu", "activity_regularizer": null, "name": "decoder_conv2DT_1", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"name": "decoder_up_sampling_1", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "decoder_up_sampling_1", "size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "relu", "activity_regularizer": null, "name": "decoder_conv2DT_2", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}, {"name": "decoder_up_sampling_2", "class_name": "UpSampling2D", "config": {"trainable": true, "name": "decoder_up_sampling_2", "size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]]}, {"name": "decoder_conv2DT_3", "class_name": "Conv2DTranspose", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "sigmoid", "activity_regularizer": null, "name": "decoder_conv2DT_3", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 1, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]]}]}, "keras_version": "2.0.3"}