{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["latent_space", 0, 0]], "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "name": "encoder_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "encoder_conv2D_1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "relu", "activity_regularizer": null, "name": "encoder_conv2D_1", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "encoder_max_pooling_1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid", "name": "encoder_max_pooling_1", "pool_size": [2, 2]}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]]}, {"name": "encoder_conv2D_2", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "relu", "activity_regularizer": null, "name": "encoder_conv2D_2", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"name": "encoder_max_pooling_2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid", "name": "encoder_max_pooling_2", "pool_size": [2, 2]}, "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]]}, {"name": "encoder_z_mean", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "encoder_z_mean", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]]}, {"name": "encoder_z_log_var", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "activity_regularizer": null, "name": "encoder_z_log_var", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]]}, {"name": "latent_space", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\fcvae_deep.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "output_shape": null, "trainable": true, "output_shape_type": "raw", "arguments": {}, "name": "latent_space", "function_type": "lambda"}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]]}]}, "keras_version": "2.0.3"}