{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_3", "input_layers": [["encoder_input", 0, 0]], "output_layers": [["model_2", 1, 0]], "layers": [{"name": "encoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 28, 28], "name": "encoder_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "model_1", "class_name": "Model", "config": {"output_layers": [["latent_space", 0, 0]], "input_layers": [["encoder_input", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 1, 28, 28], "name": "encoder_input", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "name": "encoder_input", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "padding": "same", "activity_regularizer": null, "name": "encoder_conv2D_1", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2D", "name": "encoder_conv2D_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid", "name": "encoder_max_pooling_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "encoder_max_pooling_1", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "padding": "same", "activity_regularizer": null, "name": "encoder_conv2D_2", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2D", "name": "encoder_conv2D_2", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid", "name": "encoder_max_pooling_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "encoder_max_pooling_2", "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "valid", "activity_regularizer": null, "name": "encoder_z_mean", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2D", "name": "encoder_z_mean", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "linear", "padding": "valid", "activity_regularizer": null, "name": "encoder_z_log_var", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2D", "name": "encoder_z_log_var", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]]}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\fcvae_deep.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "output_shape": null, "trainable": true, "output_shape_type": "raw", "arguments": {}, "name": "latent_space", "function_type": "lambda"}, "class_name": "Lambda", "name": "latent_space", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]]}]}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"name": "model_2", "class_name": "Model", "config": {"output_layers": [["decoder_conv2DT_3", 0, 0]], "input_layers": [["decoder_input", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 4, 5, 5], "name": "decoder_input", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "name": "decoder_input", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "padding": "valid", "activity_regularizer": null, "name": "decoder_conv2DT_1", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"config": {"name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D", "name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "padding": "same", "activity_regularizer": null, "name": "decoder_conv2DT_2", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 4, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]]}, {"config": {"name": "decoder_up_sampling_2", "trainable": true, "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D", "name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_size": [3, 3], "activation": "sigmoid", "padding": "same", "activity_regularizer": null, "name": "decoder_conv2DT_3", "bias_constraint": null, "strides": [1, 1], "trainable": true, "data_format": "channels_first", "use_bias": true, "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "kernel_regularizer": null, "filters": 1, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "kernel_constraint": null}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]]}]}, "inbound_nodes": [[["model_1", 1, 0, {}]]]}]}, "keras_version": "2.0.3"}