{"config": {"input_layers": [["encoder_input", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "sparse": false, "name": "encoder_input"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "encoder_input"}, {"config": {"filters": 1, "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_1", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [2, 2], "padding": "same", "name": "conv2d_2", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_3", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"filters": 64, "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "conv2d_4", "activation": "relu", "kernel_regularizer": null, "data_format": "channels_first", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"config": {"activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"config": {"activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_3"}, {"config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_chollet.py\u00da\bsampling\u0081\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "output_shape": null, "trainable": true, "function_type": "lambda", "name": "latent_space", "output_shape_type": "raw"}, "class_name": "Lambda", "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]], "name": "latent_space"}], "output_layers": [["latent_space", 0, 0]], "name": "model_1"}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}