{"keras_version": "2.0.3", "config": {"name": "model_2", "output_layers": [["decoder_conv2DT_3", 0, 0]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 5, 5], "name": "decoder_input"}, "class_name": "InputLayer"}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "strides": [1, 1], "filters": 8, "use_bias": true, "name": "decoder_conv2DT_1", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"trainable": true, "name": "decoder_up_sampling_1", "data_format": "channels_first", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 8, "use_bias": true, "name": "decoder_conv2DT_2", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}, {"name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "config": {"trainable": true, "name": "decoder_up_sampling_2", "data_format": "channels_first", "size": [2, 2]}, "class_name": "UpSampling2D"}, {"name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 1, "use_bias": true, "name": "decoder_conv2DT_3", "kernel_constraint": null, "data_format": "channels_first", "activation": "sigmoid", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}], "input_layers": [["decoder_input", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}