{"class_name": "Model", "config": {"output_layers": [["decoder_conv2DT_2", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "name": "decoder_input", "batch_input_shape": [null, 4, 11, 11], "dtype": "float32"}, "class_name": "InputLayer", "name": "decoder_input"}, {"inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 8, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "name": "decoder_conv2DT_1", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "use_bias": true}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_1"}, {"inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "name": "decoder_up_sampling_1", "data_format": "channels_first"}, "class_name": "UpSampling2D", "name": "decoder_up_sampling_1"}, {"inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "filters": 1, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "sigmoid", "name": "decoder_conv2DT_2", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "use_bias": true}, "class_name": "Conv2DTranspose", "name": "decoder_conv2DT_2"}], "name": "model_2", "input_layers": [["decoder_input", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow"}