{"class_name": "Model", "config": {"output_layers": [["model_2", 1, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "name": "encoder_input", "batch_input_shape": [null, 1, 28, 28], "dtype": "float32"}, "class_name": "InputLayer", "name": "encoder_input"}, {"inbound_nodes": [[["encoder_input", 0, 0, {}]]], "config": {"output_layers": [["latent_space", 0, 0]], "layers": [{"config": {"sparse": false, "name": "encoder_input", "batch_input_shape": [null, 1, 28, 28], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "encoder_input"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "activity_regularizer": null, "use_bias": true, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "name": "encoder_conv2D_1"}, "class_name": "Conv2D", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "name": "encoder_conv2D_1"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "encoder_max_pooling_1"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_max_pooling_1"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 4, "activity_regularizer": null, "use_bias": true, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "name": "encoder_z_mean"}, "class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_mean"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 4, "activity_regularizer": null, "use_bias": true, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "name": "encoder_z_log_var"}, "class_name": "Conv2D", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_log_var"}, {"config": {"output_shape_type": "raw", "trainable": true, "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u000e\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "function_type": "lambda", "name": "latent_space"}, "class_name": "Lambda", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_var", 0, 0, {}]]], "name": "latent_space"}], "name": "model_1", "input_layers": [["encoder_input", 0, 0]]}, "class_name": "Model", "name": "model_1"}, {"inbound_nodes": [[["model_1", 1, 0, {}]]], "config": {"output_layers": [["decoder_conv2DT_2", 0, 0]], "layers": [{"config": {"sparse": false, "name": "decoder_input", "batch_input_shape": [null, 4, 11, 11], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "decoder_input"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "activity_regularizer": null, "use_bias": true, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "name": "decoder_conv2DT_1"}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "name": "decoder_conv2DT_1"}, {"config": {"trainable": true, "size": [2, 2], "name": "decoder_up_sampling_1", "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1, "activity_regularizer": null, "use_bias": true, "data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activation": "sigmoid", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.5}}, "padding": "valid", "bias_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 1.0, "seed": null, "stddev": 0.5}}, "name": "decoder_conv2DT_2"}, "class_name": "Conv2DTranspose", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2"}], "name": "model_2", "input_layers": [["decoder_input", 0, 0]]}, "class_name": "Model", "name": "model_2"}], "name": "model_3", "input_layers": [["encoder_input", 0, 0]]}, "keras_version": "2.0.3", "backend": "tensorflow"}