{"keras_version": "2.0.3", "config": {"name": "model_3", "output_layers": [["model_2", 1, 0]], "layers": [{"name": "encoder_input", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28], "name": "encoder_input"}, "class_name": "InputLayer"}, {"name": "model_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "config": {"name": "model_1", "output_layers": [["latent_space", 0, 0]], "layers": [{"name": "encoder_input", "inbound_nodes": [], "config": {"dtype": "float32", "name": "encoder_input", "batch_input_shape": [null, 1, 28, 28], "sparse": false}, "class_name": "InputLayer"}, {"name": "encoder_conv2D_1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 8, "use_bias": true, "name": "encoder_conv2D_1", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2D"}, {"name": "encoder_max_pooling_1", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "config": {"name": "encoder_max_pooling_1", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "encoder_conv2D_2", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 8, "use_bias": true, "name": "encoder_conv2D_2", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2D"}, {"name": "encoder_max_pooling_2", "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "config": {"name": "encoder_max_pooling_2", "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"name": "encoder_z_mean", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 4, "use_bias": true, "name": "encoder_z_mean", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2D"}, {"name": "encoder_z_log_sigma", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 4, "use_bias": true, "name": "encoder_z_log_sigma", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2D"}, {"name": "latent_space", "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]], "config": {"name": "latent_space", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\fcvae_deep.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "trainable": true, "arguments": {}, "function_type": "lambda", "output_shape_type": "raw"}, "class_name": "Lambda"}], "input_layers": [["encoder_input", 0, 0]]}, "class_name": "Model"}, {"name": "model_2", "inbound_nodes": [[["model_1", 1, 0, {}]]], "config": {"name": "model_2", "output_layers": [["decoder_conv2DT_3", 0, 0]], "layers": [{"name": "decoder_input", "inbound_nodes": [], "config": {"dtype": "float32", "name": "decoder_input", "batch_input_shape": [null, 4, 5, 5], "sparse": false}, "class_name": "InputLayer"}, {"name": "decoder_conv2DT_1", "inbound_nodes": [[["decoder_input", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "strides": [1, 1], "filters": 8, "use_bias": true, "name": "decoder_conv2DT_1", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "config": {"trainable": true, "name": "decoder_up_sampling_1", "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D"}, {"name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 8, "use_bias": true, "name": "decoder_conv2DT_2", "kernel_constraint": null, "data_format": "channels_first", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}, {"name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2DT_2", 0, 0, {}]]], "config": {"trainable": true, "name": "decoder_up_sampling_2", "size": [2, 2], "data_format": "channels_first"}, "class_name": "UpSampling2D"}, {"name": "decoder_conv2DT_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 1, "use_bias": true, "name": "decoder_conv2DT_3", "kernel_constraint": null, "data_format": "channels_first", "activation": "sigmoid", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"mean": 1.0, "seed": null, "stddev": 0.5}, "class_name": "TruncatedNormal"}}, "class_name": "Conv2DTranspose"}], "input_layers": [["decoder_input", 0, 0]]}, "class_name": "Model"}], "input_layers": [["encoder_input", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}