{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28], "name": "input_1"}}, {"name": "encoder_conv2D_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 16, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "encoder_conv2D_1", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "encoder_max_pooling_1", "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "padding": "same", "pool_size": [2, 2], "name": "encoder_max_pooling_1", "trainable": true, "strides": [2, 2]}}, {"name": "encoder_conv2D_2", "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 8, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "encoder_conv2D_2", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "encoder_max_pooling_2", "inbound_nodes": [[["encoder_conv2D_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "padding": "same", "pool_size": [2, 2], "name": "encoder_max_pooling_2", "trainable": true, "strides": [2, 2]}}, {"name": "encoder_conv2D_3", "inbound_nodes": [[["encoder_max_pooling_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 8, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "encoder_conv2D_3", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "encoder_max_pooling_3", "inbound_nodes": [[["encoder_conv2D_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "padding": "same", "pool_size": [2, 2], "name": "encoder_max_pooling_3", "trainable": true, "strides": [2, 2]}}, {"name": "decoder_conv2D_1", "inbound_nodes": [[["encoder_max_pooling_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 8, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "decoder_conv2D_1", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2D_1", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_1", "trainable": true, "size": [2, 2]}}, {"name": "decoder_conv2D_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 8, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "decoder_conv2D_2", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "decoder_up_sampling_2", "inbound_nodes": [[["decoder_conv2D_2", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_2", "trainable": true, "size": [2, 2]}}, {"name": "decoder_conv2D_3", "inbound_nodes": [[["decoder_up_sampling_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 16, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "decoder_conv2D_3", "activation": "relu", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}, {"name": "decoder_up_sampling_3", "inbound_nodes": [[["decoder_conv2D_3", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"data_format": "channels_first", "name": "decoder_up_sampling_3", "trainable": true, "size": [2, 2]}}, {"name": "decoder_conv2D_4", "inbound_nodes": [[["decoder_up_sampling_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"padding": "same", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 1.0}}, "strides": [1, 1], "filters": 1, "data_format": "channels_first", "kernel_regularizer": null, "use_bias": true, "name": "decoder_conv2D_4", "activation": "sigmoid", "trainable": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.5, "mean": 0.0}}, "bias_regularizer": null}}], "output_layers": [["decoder_conv2D_4", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.2"}