{"config": {"name": "model_2", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 16], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"trainable": true, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4"}, {"config": {"trainable": true, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 12544, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5"}, {"config": {"trainable": true, "target_shape": [64, 14, 14], "name": "reshape_1"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_transpose_1", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_transpose_2", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null, "padding": "valid", "activation": "relu", "name": "conv2d_transpose_3", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3"}, {"config": {"kernel_size": [2, 2], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "activation": "sigmoid", "name": "conv2d_5", "filters": 1, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5"}], "output_layers": [["conv2d_5", 0, 0]]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}