{"config": {"name": "model_1", "input_layers": [["encoder_input", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28], "name": "encoder_input"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "encoder_input"}, {"config": {"kernel_size": [2, 2], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_1", "filters": 1, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["encoder_input", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1"}, {"config": {"kernel_size": [2, 2], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_2", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_3", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "activation": "relu", "name": "conv2d_4", "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "data_format": "channels_first"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"trainable": true, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"trainable": true, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}, {"config": {"trainable": true, "activation": "linear", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3"}, {"config": {"output_shape_type": "raw", "function_type": "lambda", "trainable": true, "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\tz_log_var\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u000fcvae_chollet.py\u00da\bsampling\u009c\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0002\f\u0002,\u0002\u0013\u0002\u001e\u0002", null, null], "name": "latent_space"}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]], "class_name": "Lambda", "name": "latent_space"}], "output_layers": [["latent_space", 0, 0]]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}