{"config": {"name": "model_2", "layers": [{"config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 11, 11]}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 8, "data_format": "channels_first", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "decoder_conv2DT_1", "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "use_bias": true, "activation": "relu", "kernel_regularizer": null}, "name": "decoder_conv2DT_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"config": {"size": [2, 2], "name": "decoder_up_sampling_1", "data_format": "channels_first", "trainable": true}, "name": "decoder_up_sampling_1", "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 1, "data_format": "channels_first", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "decoder_conv2DT_2", "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {"mean": 1.0, "stddev": 0.5, "seed": null}, "class_name": "TruncatedNormal"}, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null}, "name": "decoder_conv2DT_2", "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["decoder_conv2DT_2", 0, 0]]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}