{"config": {"name": "model_3", "layers": [{"config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28]}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "model_1", "layers": [{"config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1, 28, 28]}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 8, "data_format": "channels_first", "kernel_initializer": {"config": {"stddev": 0.5, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "name": "encoder_conv2D_1", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {"stddev": 0.5, "mean": 1.0, "seed": null}, "class_name": "TruncatedNormal"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "encoder_conv2D_1", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "encoder_max_pooling_1", "padding": "valid", "data_format": "channels_first", "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["encoder_conv2D_1", 0, 0, {}]]], "name": "encoder_max_pooling_1", "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 4, "data_format": "channels_first", "kernel_initializer": {"config": {"stddev": 0.5, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "name": "encoder_z_mean", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {"stddev": 0.5, "mean": 1.0, "seed": null}, "class_name": "TruncatedNormal"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_mean", "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 4, "data_format": "channels_first", "kernel_initializer": {"config": {"stddev": 0.5, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "name": "encoder_z_log_sigma", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {"stddev": 0.5, "mean": 1.0, "seed": null}, "class_name": "TruncatedNormal"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["encoder_max_pooling_1", 0, 0, {}]]], "name": "encoder_z_log_sigma", "class_name": "Conv2D"}, {"config": {"name": "latent_space", "output_shape_type": "raw", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s~\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019|\u0002\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019k\u0002\u0000s8\u0000t\u0001\u0000\u0082\u0001\u0000|\u0001\u0000j\u0000\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000\u0019}\u0003\u0000t\u0002\u0000j\u0003\u0000d\u0002\u0000|\u0003\u0000d\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000\u0083\u0000\u0003}\u0004\u0000|\u0001\u0000t\u0002\u0000j\u0004\u0000|\u0002\u0000\u0083\u0001\u0000|\u0004\u0000\u0014\u0017S)\u0007N\u00e9\u0001\u0000\u0000\u0000\u00da\u0005shape\u00da\u0004mean\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u00da\u0006stddev\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?)\u0005r\u0002\u0000\u0000\u0000\u00da\u000eAssertionError\u00da\u0001K\u00da\rrandom_normal\u00da\u0003exp)\u0005\u00da\u0004args\u00da\u0006z_mean\u00da\u000bz_log_sigma\u00da\foutput_shape\u00da\u0007epsilon\u00a9\u0000r\u0010\u0000\u0000\u0000\u00fa\u0007cvae.py\u00da\bsampling\u0011\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\f\u0001,\u0001\u0013\u0001\u001e\u0001", null, null], "output_shape": null, "function_type": "lambda", "trainable": true}, "inbound_nodes": [[["encoder_z_mean", 0, 0, {}], ["encoder_z_log_sigma", 0, 0, {}]]], "name": "latent_space", "class_name": "Lambda"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["latent_space", 0, 0]]}, "name": "model_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Model"}, {"config": {"name": "model_2", "layers": [{"config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 11, 11]}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 8, "data_format": "channels_first", "kernel_initializer": {"config": {"stddev": 0.5, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "name": "decoder_conv2DT_1", "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "bias_initializer": {"config": {"stddev": 0.5, "mean": 1.0, "seed": null}, "class_name": "TruncatedNormal"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "decoder_conv2DT_1", "class_name": "Conv2DTranspose"}, {"config": {"size": [2, 2], "name": "decoder_up_sampling_1", "data_format": "channels_first", "trainable": true}, "inbound_nodes": [[["decoder_conv2DT_1", 0, 0, {}]]], "name": "decoder_up_sampling_1", "class_name": "UpSampling2D"}, {"config": {"bias_regularizer": null, "padding": "valid", "filters": 1, "data_format": "channels_first", "kernel_initializer": {"config": {"stddev": 0.5, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "activation": "sigmoid", "strides": [1, 1], "name": "decoder_conv2DT_2", "activity_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "bias_initializer": {"config": {"stddev": 0.5, "mean": 1.0, "seed": null}, "class_name": "TruncatedNormal"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["decoder_up_sampling_1", 0, 0, {}]]], "name": "decoder_conv2DT_2", "class_name": "Conv2DTranspose"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["decoder_conv2DT_2", 0, 0]]}, "name": "model_2", "inbound_nodes": [[["model_1", 1, 0, {}]]], "class_name": "Model"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["model_2", 1, 0]]}, "keras_version": "2.0.3", "class_name": "Model", "backend": "tensorflow"}